{
  "userForm": [
    {
      "id": 1,
      "name": "Assem Mukhamadi",
      "email": "assem@mail.ru",
      "password": "qwerty"
    },
    {
      "id": 2,
      "name": "Gaukhar Mukhamadi",
      "email": "goha@mail.ru",
      "password": "qwerty"
    },
    {
      "name": "Dana",
      "email": "dana@mail.ru",
      "password": "qwerty123",
      "id": 3
    }
  ],
  "breed": [
    {
      "id": 1,
      "breedId": 2,
      "likeStatus": false,
      "category": "Cat",
      "cost": 1000,
      "name": "British Shorthair",
      "image": "https://bosch-club.ru/upload/iblock/f36/f36cc496802e10056b9bee7fa6114464.jpg",
      "information": "Modern British Shorthair cats are well-built animals of medium to large size with a powerful body, stocky legs and strong rounded paws. The weight of an adult animal ranges from 3 to 7 kg, cats are larger than cats. The round head is crowned with wide - set ears of medium size. A muzzle with full cheeks and large round wide eyes will not leave anyone indifferent. The coat of these cats is short, dense, shiny, with a well-developed undercoat. It doesn't fit the body, which makes it look plush. The most popular color among fans of the breed is blue. However, thanks to breeding work, today the breed has about 200 different colors: plain (black, blue, chocolate, purple, red, cream, white), tortoiseshell, typed (smoky, shaded, chinchilla), tabby (marbled, mackerel, spotted), color-point, bicolor. As a rule, the British have bright orange eyes, but depending on the color it can be blue, blue, green."
    },
    {
      "id": 2,
      "breedId": 2,
      "likeStatus": true,
      "category": "Cat",
      "cost": 1000,
      "name": "Ojos azules. Blue eyes",
      "image": "https://bosch-club.ru/upload/resize_cache/iblock/3cf/300_300_1/3cf0e3770d4b533aa5cc0778e9d3e3f2.jpg",
      "information": "Ojos azules from the Spanish phrase \"Ojos azules\" means \"blue eyes\". It is this feature of the Ojos azules cats that has become the main factor in the development of this new breed. These cats do not have Siamese cats in their pedigree, and the blue color was a natural mutation that gave the azure eye color to these cats. In addition to this typical, it is for Siamese cats, the color of the eye, cats of the Ojos azules breed are no longer remarkable. Characteristics of the breed's appearance: triangular head shape, bright protruding cheekbones, developed but not protruding chin form a medium-sized muzzle. The transition from the nose to the forehead has a small concavity."
    },
    {
      "id": 3,
      "breedId": 2,
      "likeStatus": true,
      "category": "Cat",
      "cost": 1000,
      "name": "Bengal cat",
      "image": "https://bosch-club.ru/upload/iblock/b61/b61e3b0cacb013c53757b7bc701d3e93.jpg",
      "information": "Powerful and elongated body with well-developed muscles, strong bones, medium-length paws. The head is proportional to the body with well-developed jaws. The ears are quite short with a wide base and are located as wide as possible. The eyes are round, bright and expressive."
    },
    {
      "id": 4,
      "breedId": 3,
      "likeStatus": false,
      "category": "Dog",
      "cost": 1000,
      "name": "Dalmatian",
      "image": "https://petsi.net/images/dogphotos/bench-dalmatians.jpg",
      "information": "The Dalmatian dog breed is a lean, but strong and muscular animal with an aesthetic and well-proportioned physique. The muzzle is elongated, the ears are folded. The limbs are slightly longer than the average, the chest is pronounced, as is the abdominal cavity. The coat is short, soft, thick and shiny. Color white with a black spot."
    },
    {
      "id": 5,
      "breedId": 3,
      "likeStatus": false,
      "category": "Dog",
      "cost": 1000,
      "name": "Akita Inu",
      "image": "https://petsi.net/images/dogbreed/big/20.jpg",
      "information": "The Japanese Akita inu is a large dog with a powerful build, large muscles and a round head. Ears are erect. The limbs are muscular, of medium length, and the tail is sabre-shaped and bushy. The coat is long."
    },
    {
      "id": 6,
      "breedId": 3,
      "likeStatus": false,
      "category": "Dog",
      "cost": 1000,
      "name": "Alaskan Malamute",
      "image": "https://petsi.net/images/dogphotos/walking-alaskan-malamute.jpg",
      "information": "The Alaskan Malamute dog breed resembles large wolves, has a large build, a wide, powerful chest, medium-length limbs, muscular and very strong. Tail, fluffy saber-shaped. These animals are generally characterized by great strength and endurance, which is evident in their every movement. The head is large, the ears are erect, and the nape of the neck stands out clearly. The coat is long."
    },
    {
      "id": 7,
      "breedId": 4,
      "likeStatus": false,
      "category": "Fish",
      "cost": 1000,
      "name": "Goby-Bumblebee",
      "image": "https://www.aqvium.ru/images/fish-new/unusual/23-Brachygobius-xanthozonus/23-2-Brachygobius-xanthozonus.jpg",
      "information": "The goby bee, Golden-banded Goby, or bumblebee Goby, scientific name Brachygobius doriae, belongs to the family Gobiidae. For a long time there was confusion and this species was mistakenly attributed to Brachygobius xanthozonus, which is not found in aquariums at all. However, both of these fish are almost identical and live in similar conditions, so for ordinary aquarists errors in scientific names do not matter."
    },
    {
      "id": 8,
      "breedId": 4,
      "likeStatus": false,
      "category": "Fish",
      "cost": 1000,
      "name": "River slope",
      "image": "https://www.aqvium.ru/images/fish-new/unusual/07-Potamotrygon-motoro/07-1-Potamotrygon-motoro.jpg",
      "information": "The eye-tailed Stingray or South American river Stingray, scientific name Potamotrygon motoro, belongs to the family Potamotrygonidae (River stingrays). Predatory and dangerous for the aquarist fish because of its spike on the tip of the tail. It requires large expenses for its maintenance, including maintenance of equipment and the purchase of large volumes of fresh or live feed. They are rarely found in Amateur aquariums."
    },
    {
      "id": 9,
      "breedId": 4,
      "likeStatus": false,
      "category": "Fish",
      "cost": 1000,
      "name": "Nymph",
      "image": "https://www.aqvium.ru/images/fish-new/goldfish/06.fantail-goldfish/06-3.fantail-goldfish.jpg",
      "information": "Nymph (Fantail Goldfish-English), as well as its Japanese counterpart Ryukin (Ryukin) are decorative species that are specially bred to participate in various specialized exhibitions. The main feature is a large caudal fin. The most perfect forms have a fully forked tail, which looks like a triangle when viewed from above. The anal fin is similarly divided. Those specimens whose fins are not completely separated or have asymmetrical parts are destined to become a simple pet, they will not be able to win any award. The most common variety with a reddish-orange color, but there are also spotted, mother-of-pearl and even white."
    },
    {
      "id": 10,
      "breedId": 1,
      "likeStatus": false,
      "category": "Bird",
      "cost": 1000,
      "name": "Finches",
      "image": "https://opt-1031816.ssl.1c-bitrix-cdn.ru/upload/resize_cache/iblock/257/750_400_1/257a39fab62fc46b216e437d8ecfb884.png?1528247448409318",
      "information": "Finches – tiny, proportional, very beautiful birds with bright plumage. Body length-no more than 11 cm. As a rule, a bright color is formed in birds at the age of about 10 weeks. Some amadins tend to change color depending on the season, during the mating season, males acquire a bright red color."
    },
    {
      "id": 11,
      "breedId": 1,
      "likeStatus": false,
      "category": "Bird",
      "cost": 1000,
      "name": "Macaw parrot",
      "image": "https://opt-1031816.ssl.1c-bitrix-cdn.ru/upload/resize_cache/iblock/2be/750_400_1/2bee838cea13918b583998999ccc9148.png?1528247933532750",
      "information": "Macaws are very large, colorful, exotic parrots, whose body length can reach 98 cm (hyacinth macaw). One of the main features of these birds is the almost complete absence of plumage on the sides of the head and the area around the eyes. Otherwise, the plumage of the macaw is very dense, it shimmers beautifully in various shades (blue, red, green) and has a wide range of colors. The plumage color of young macaws is almost identical to that of adults, and the color of males and females is also similar."
    },
    {
      "id": 12,
      "breedId": 1,
      "likeStatus": true,
      "category": "Bird",
      "cost": 1000,
      "name": "Carduelis",
      "image": "https://opt-1031816.ssl.1c-bitrix-cdn.ru/upload/resize_cache/iblock/fa4/750_400_1/fa47975a61bf83ca9037d5b6e24d91ca.png?1528192271423210",
      "information": "Goldfinches in nature are not just beautiful birds, but also useful helpers that destroy a huge number of harmful insects. The friendly nature, sociability and intelligence of goldfinches make them excellent Pets. These birds easily adapt to life in captivity, are trainable and can even master various tricks, in addition, they delight their owners with beautiful singing almost all year round."
    },
    {
      "id": 13,
      "breedId": 5,
      "likeStatus": false,
      "category": "Reptile",
      "cost": 1000,
      "name": "Chameleon",
      "image": "https://i2.rozetka.ua/tips/315/315486.jpg",
      "information": "Arboreal animals of medium size (up to 30 cm in length). Of course, the main attractive feature of chameleons is their ability to change the color and pattern of the skin. Even more interesting is the fact that the main purpose of this function of the skin is communication, that is, by changing the color, chameleons communicate with each other. Disguising the environment is secondary. Chameleon owners can determine the mood of their pet by its pattern and skin color. However, it is worth noting that the content of these lizards is associated with certain difficulties."
    },
    {
      "id": 14,
      "breedId": 5,
      "likeStatus": false,
      "category": "Reptile",
      "cost": 1000,
      "name": "Turtles",
      "image": "https://horoshun.com.ua/all/b10/z5naflegdd_vfhqlah5q9.jpg",
      "information": "For keeping in aquaterrariums, a small and widespread red-eared turtle (Trachemys scripta scripta) is most often chosen. These reptiles are small in size. Their carapax (dorsal shield consisting of a bony base and horn plates) reaches a length of 30 cm, but is usually smaller in captivity. Red-eared turtles have bright spots around their ears, which make them attractive. Turtles of this species are quite mobile, so they are interesting to watch."
    },
    {
      "id": 15,
      "breedId": 5,
      "likeStatus": false,
      "category": "Reptile",
      "cost": 1000,
      "name": "Lizard",
      "image": "https://catfishes.ru/wp-content/uploads/2020/02/yashcer1.jpg",
      "information": "Home place of lizards-a terrarium. You can only let it out on the floor for a short time – to avoid hypothermia. For this reason, the height is made at least two heights, about the same width and twice the length. For well-climbing vertical species, the vertical size is increased or provided by mesh (non-traumatic) fences. Good ventilation should be provided in the side walls."
    },
    {
      "id": 16,
      "category": "Rodent",
      "likeStatus": false,
      "cost": 1000,
      "breedId": 6,
      "name": "Syrian hamster",
      "image": "https://www.hvoost.ru/upload/medialibrary/4c7/4c79a78867836c6e3be2214e183a30db.jpg",
      "information": "A fairly large rodent with a body length of up to 18 cm, with soft fur of sandy or Golden color. They live for 2-3 years. By nature, Syrian hamsters are solitary, and it is better to keep them one at a time, because even a different-sex couple will inevitably fight."
    },
    {
      "id": 17,
      "breedId": 6,
      "likeStatus": false,
      "category": "Rodent",
      "cost": 1000,
      "name": "Gerbils",
      "image": "https://www.hvoost.ru/upload/medialibrary/8d4/8d4011ded5b92edf01049b5e3b969e81.jpeg",
      "information": "Most often, the Mongolian gerbil is kept as a pet. These are miniature animals from 9 to 15 centimeters long, with a lowered tail and a brush at its end. They live on average 2-3 years.  The gerbil is fed a grain mixture, adding sprouted grass, dried and fresh vegetables. You can sometimes give a feed insect or low-fat cottage cheese. The only thing - should be limited to give fatty and oily products. Gerbils love them very much, but an overabundance can negatively affect the pet's health. For grinding teeth, mineral stone (which, in addition, replenishes the mineral-salt balance in the body) and branches of deciduous trees will be useful."
    },
    {
      "id": 18,
      "breedId": 6,
      "likeStatus": false,
      "category": "Rodent",
      "cost": 1000,
      "name": "Rabbit",
      "image": "https://www.hvoost.ru/upload/medialibrary/215/215f2e487c36cdb4eaf6696b485e2979.jpg",
      "information": "Rabbits are not rodents, but belong to the order of hares, which also includes hares and pika. The main difference from rodents is the presence of two incisors on the upper jaw instead of one pair. Many breeds of decorative rabbits have been bred, with very different types of hair and color, size and position of the ears. Decorative rabbit usually lives in captivity 5-7, and in ideal conditions, if it turns out to be a centenarian, then 10 years. Larger animals in most cases please their owners longer."
    }
  ],
  "basket": [
    {
      "id": 3,
      "breedId": 2,
      "likeStatus": true,
      "category": "Cat",
      "cost": 1000,
      "name": "Bengal cat",
      "image": "https://bosch-club.ru/upload/iblock/b61/b61e3b0cacb013c53757b7bc701d3e93.jpg",
      "information": "Powerful and elongated body with well-developed muscles, strong bones, medium-length paws. The head is proportional to the body with well-developed jaws. The ears are quite short with a wide base and are located as wide as possible. The eyes are round, bright and expressive."
    },
    {
      "id": 4,
      "breedId": 3,
      "likeStatus": true,
      "category": "Dog",
      "cost": 1000,
      "name": "Dalmatian",
      "image": "https://petsi.net/images/dogphotos/bench-dalmatians.jpg",
      "information": "The Dalmatian dog breed is a lean, but strong and muscular animal with an aesthetic and well-proportioned physique. The muzzle is elongated, the ears are folded. The limbs are slightly longer than the average, the chest is pronounced, as is the abdominal cavity. The coat is short, soft, thick and shiny. Color white with a black spot."
    }
  ]
}